## Suite Brief des Livres

Reprendre votre brief des livres et créer une API FastAPI avec 2 routes simples de votre choix

In [26]:
import sqlite3
from sqlalchemy import create_engine, text
import nest_asyncio
import uvicorn
import pandas as pd
from fastapi import FastAPI, Form, Request
from fastapi.responses import HTMLResponse

In [27]:
df=pd.read_csv('books.csv')
df.head()

                                   title rating  price availability category
0                   A Light in the Attic  Three  51.77     In stock    Books
1                     Tipping the Velvet    One  53.74     In stock    Books
2                             Soumission    One  50.10     In stock    Books
3                          Sharp Objects   Four  47.82     In stock    Books
4  Sapiens: A Brief History of Humankind   Five  54.23     In stock    Books

In [20]:
df.shape

(1723, 5)

## Avec MySQL

In [34]:

# Connexion à la base MySQL
engine = create_engine("mysql+mysqlconnector://root:root@localhost/books_db")

#

In [19]:
#Insérer des données depuis pandas

df.to_sql('books', con=engine, if_exists='replace', index=False)

1723

In [35]:
#  Pour charger directement un DataFrame
with engine.connect() as conn:
    df_books2 = pd.read_sql(text("SELECT * FROM Books"), con=conn)

df_books2.head()

                                   title rating  price availability category
0                   A Light in the Attic  Three  51.77     In stock    Books
1                     Tipping the Velvet    One  53.74     In stock    Books
2                             Soumission    One  50.10     In stock    Books
3                          Sharp Objects   Four  47.82     In stock    Books
4  Sapiens: A Brief History of Humankind   Five  54.23     In stock    Books

## Avec  SQLite

In [28]:
# --- Initialisation de la base SQLite ---
connection = sqlite3.connect("books_db.db")

In [29]:
cursor = connection.cursor()

cursor.execute("""
CREATE TABLE IF NOT EXISTS Books (
    id_livre INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT,
    rating REAL,
    price REAL,
    availability TEXT,
    category TEXT
)
""")

connection.commit()

In [30]:
#Insérer des données depuis pandas

df.to_sql('Books', con=connection, if_exists='append', index=False)

1723

In [31]:
# Lecture de la table Books dans un DataFrame
df_books1 = pd.read_sql("SELECT * FROM Books;", con=connection)

# Affichage
df_books1.head()

,id_livre,title,rating,price,availability,category
0,1,A Light in the Attic,Three,51.77,In stock,Books
1,2,Tipping the Velvet,One,53.74,In stock,Books
2,3,Soumission,One,50.10,In stock,Books
3,4,Sharp Objects,Four,47.82,In stock,Books
4,5,Sapiens: A Brief History of Humankind,Five,54.23,In stock,Books

In [22]:
connection.close()

## Mon API

In [ ]:

nest_asyncio.apply()
app = FastAPI()

# --- Lire tous les livres ---
@app.get("/livres")
async def get_books():
    conn = sqlite3.connect("books_db.db")
    cur = conn.cursor()
    cur.execute("SELECT * FROM books")
    rows = cur.fetchall()
    conn.close()
    return {"books": rows}

@app.get("/livres1")
async def get_books():
    conn = sqlite3.connect("books_db.db")

    # Charger en DataFrame
    df_books = pd.read_sql("SELECT * FROM books;", con=conn)
    conn.close()

    # Transformer en JSON type tableau [{col:val, ...}, {...}]
    books_list = df_books.to_dict(orient="records")

    return {"books": books_list}


@app.get("/", response_class=HTMLResponse)
async def add():
    return """
    <h2>Ajouter livre</h2>
    <form action="/add" method="post">
        titre : <input type="text" name="title"><br>
        prix : <input type="float" name="price"><br>
        <input type="submit" value="Ajouter">
    </form>
    """

@app.post("/add")
async def add_book(title: str = Form(...), price: str = Form(...)):
    try:
        conn = sqlite3.connect("books_db.db")
        cur = conn.cursor()
        cur.execute("INSERT INTO books (title, price) VALUES (?, ?)", (title, price))
        conn.commit()
        message = f"Le livre {title} ajouté avec succès !"
    except sqlite3.IntegrityError:
        message = f"{title} est déjà dans la liste."
    finally:
        conn.close()
    return HTMLResponse(f"<p>{message}</p><a href='/'>Retour</a>")


# --- Supprimer un livre ---
@app.get("/delete-book/{book_id}")
async def delete_user(book_id: int):
    conn = sqlite3.connect("books_db.db")
    cur = conn.cursor()
    cur.execute("DELETE FROM books WHERE id_livre = ?", (book_id,))
    conn.commit()
    conn.close()
    return {"message": f"Livre {book_id} supprimé."}

# --- Lancer l’app ---
uvicorn.run(app, host="127.0.0.1", port=4000)

INFO:     Started server process [37916]
INFO:     Waiting for application startup.
INFO:     Application startup complete.
INFO:     Uvicorn running on http://127.0.0.1:4000 (Press CTRL+C to quit)

INFO:     127.0.0.1:62777 - "GET / HTTP/1.1" 200 OK
INFO:     127.0.0.1:62777 - "GET /livres HTTP/1.1" 200 OK
INFO:     127.0.0.1:62968 - "GET / HTTP/1.1" 200 OK
INFO:     127.0.0.1:63058 - "POST /add HTTP/1.1" 200 OK
INFO:     127.0.0.1:63090 - "GET /livres HTTP/1.1" 200 OK
INFO:     127.0.0.1:63212 - "GET /delete-book/1 HTTP/1.1" 200 OK
INFO:     127.0.0.1:63213 - "GET /delete-book/1724 HTTP/1.1" 200 OK
INFO:     127.0.0.1:63223 - "GET /livres HTTP/1.1" 200 OK